vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
#include "app.h"
#include "gpio.h"
#include "main.h"
#include "tim.h"
#include <limits.h>
#include <stdio.h>
#include <string.h>
#include "stm32l4xx.h"  /* ITM/DBGMCU presence for optional binary SWO */
#include "lptim.h"      /* hlptim1 for Y encoder (LPTIM1) */

#include "Services/Log/log_service.h"
#include "Services/Motion/motion_service.h"
#include "Services/Motion/motion_hw.h"
#include "Services/Safety/safety_service.h"

#include "Protocol/Requests/move_queue_add_request.h"
#include "Protocol/Responses/move_queue_add_ack_response.h"
#include "Protocol/Requests/move_queue_status_request.h"
#include "Protocol/Responses/move_queue_status_response.h"
#include "Protocol/Requests/start_move_request.h"
#include "Protocol/Responses/start_move_response.h"
#include "Protocol/Requests/move_end_request.h"
#include "Protocol/Responses/move_end_response.h"
// Novos: set_origin e encoder_status
#include "Protocol/Requests/set_origin_request.h"
#include "Protocol/Responses/set_origin_response.h"
#include "Protocol/Requests/encoder_status_request.h"
#include "Protocol/Responses/encoder_status_response.h"
#include "Protocol/Requests/set_microsteps_request.h"
#include "Protocol/Requests/set_microsteps_axes_request.h"

LOG_SVC_DEFINE(LOG_SVC_MOTION, "motion");


#define MOTION_AXIS_COUNT        3u
// Aumenta a capacidade da fila de movimentos para reduzir "queue_full"
// Cada entrada consome ~42 bytes (move_queue_add_req_t); 256 => ~10.8 KB
#define MOTION_QUEUE_CAPACITY    256u

/* =======================
 *  Timings p/ TMC5160 + DDA
 *  (ajuste MOTION_TIM6_HZ se mudar TIM6)
 * ======================= */
#define MOTION_TIM6_HZ                 50000u   /* 50 kHz -> 20 us por tick */
#define MOTION_STEP_HIGH_TICKS         1u       /* largura do STEP: >= 1 tick (>=20us) */
#define MOTION_DIR_SETUP_TICKS         1u       
#define MOTION_ENABLE_SETTLE_TICKS     2u       

#define MOTION_STEP_LOW_TICKS          1u

#define Q16_1                          (1u<<16)
#define Q16_FROM_UINT(x)               ((uint32_t)(x) << 16)
#define Q16_DIV_UINT(numer,den)        ((uint32_t)(((uint64_t)(numer) << 16) / (uint32_t)(den)))
#ifndef MOTION_DEBUG_ENCODERS
#define MOTION_DEBUG_ENCODERS          0
#endif
#ifndef MOTION_DEBUG_FLOW
#define MOTION_DEBUG_FLOW              0
#endif
#ifndef MOTION_DEBUG_TIM6_PRINTS
#define MOTION_DEBUG_TIM6_PRINTS       0
#endif
#ifndef MOTION_DEBUG_STEP_DECIM
#define MOTION_DEBUG_STEP_DECIM        500u
#endif
/* Print de ganhos PID por segmento */
#ifndef MOTION_DEBUG_GAINS_PRINT
#define MOTION_DEBUG_GAINS_PRINT       0u
#endif

/* =======================
 *  Diagnóstico de travamentos/bloqueios (desligado por padrão)
 *  - Emite snapshots compactos em intervalos e quando detecta "stall"
 *  - Completamente desacoplado e controlado por macros
 * ======================= */
#ifndef MOTION_DIAG_ENABLE
#define MOTION_DIAG_ENABLE              0u   /* 0=off, 1=on (ativado p/ debug) */
#endif
#ifndef MOTION_DIAG_INTERVAL_MS
#define MOTION_DIAG_INTERVAL_MS         200u /* período de log periódico */
#endif
#ifndef MOTION_DIAG_STALL_MS
#define MOTION_DIAG_STALL_MS            150u /* ms sem STEP considerado stall */
#endif
#ifndef MOTION_DIAG_VERBOSE
#define MOTION_DIAG_VERBOSE             0u   /* 0=leve, 1=inclui p/i/d/corr/v_adj no DIAG */
#endif
/* Print pontual de condição suspeita (rem>0 && v_cmd==0 && queue>0) */
#ifndef MOTION_BUGCHECK_ENABLE
#define MOTION_BUGCHECK_ENABLE          0u
#endif

/* Impressão periódica de encoder a cada N pulsos (selecionável por eixo) */
#ifndef MOTION_ENC_PRINT_EVERY_N_ENABLE
#define MOTION_ENC_PRINT_EVERY_N_ENABLE 0u
#endif
#ifndef MOTION_ENC_PRINT_N
#define MOTION_ENC_PRINT_N              10u
#endif
#ifndef MOTION_ENC_PRINT_MASK
#define MOTION_ENC_PRINT_MASK           0x03u /* bits X=1,Y=2,Z=4; X+Y */
#endif

// Emissão de CSV/telemetria
#ifndef MOTION_CSV_AT_STEP
#define MOTION_CSV_AT_STEP             1u
#endif
#ifndef MOTION_CSV_STEP_DECIM
#define MOTION_CSV_STEP_DECIM          100u   /* imprime a cada N passos após o primeiro */
#endif

// Amostragem periódica do CSV (em ms). Ajuste conforme necessário.
#ifndef MOTION_CSV_SAMPLE_MS
#define MOTION_CSV_SAMPLE_MS            1u
#endif

// Produção rígida a cada 1 ms no TIM6 (50 kHz) com ring buffer (SPSC)
#ifndef MOTION_CSV_PRODUCE_IN_TIM6
#define MOTION_CSV_PRODUCE_IN_TIM6      0u   /* amostra e imprime no TIM7, sempre após atualizar encoders */
#endif
#ifndef MOTION_CSV_TEXT_ENABLE
#define MOTION_CSV_TEXT_ENABLE           1u   /* 0=desliga printf textual; 1=liga printf textual */
#endif
#ifndef MOTION_CSV_RING_CAP
#define MOTION_CSV_RING_CAP             512u /* 16 bytes × 512 × 3 eixos ≈ 24 KB */
#endif
#ifndef MOTION_CSV_DRAIN_PER_TICK
#define MOTION_CSV_DRAIN_PER_TICK       128u /* aumenta drenagem para aliviar backlog rapidamente */
#endif

/* =======================
 *  Simulação de atrito (teste)
 * ======================= */
#ifndef MOTION_SIM_FRICTION_ENABLE
#define MOTION_SIM_FRICTION_ENABLE      1u
#endif
#ifndef MOTION_SIM_FRICTION_BUTTON_B2
#define MOTION_SIM_FRICTION_BUTTON_B2   1u
#endif
#ifndef MOTION_SIM_FRICTION_AUTO_HALF
#define MOTION_SIM_FRICTION_AUTO_HALF   1u
#endif
#ifndef MOTION_SIM_FRICTION_AXIS_DEFAULT
#define MOTION_SIM_FRICTION_AXIS_DEFAULT AXIS_Y
#endif
/* Modelo físico (pós-rampa): v_eff = max(0, v - (C + B*v/1000))
 * Ajustado para IGUAL ao simulador (1×).
 */
#ifndef MOTION_SIM_FRICTION_C_SPS
#define MOTION_SIM_FRICTION_C_SPS       900u    /* Y: 900 steps/s (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_B_PERMILLE
#define MOTION_SIM_FRICTION_B_PERMILLE  25u     /* Y: 2.5% (sim) */
#endif
/* Defaults por eixo (iguais ao simulador): */
#ifndef MOTION_SIM_FRICTION_C_SPS_X
#define MOTION_SIM_FRICTION_C_SPS_X     700u    /* X: 700 steps/s (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_C_SPS_Y
#define MOTION_SIM_FRICTION_C_SPS_Y     900u    /* Y: 900 steps/s (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_C_SPS_Z
#define MOTION_SIM_FRICTION_C_SPS_Z     900u    /* Z: 900 steps/s (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_B_PERMILLE_X
#define MOTION_SIM_FRICTION_B_PERMILLE_X 20u    /* X: 2.0% (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_B_PERMILLE_Y
#define MOTION_SIM_FRICTION_B_PERMILLE_Y 25u    /* Y: 2.5% (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_B_PERMILLE_Z
#define MOTION_SIM_FRICTION_B_PERMILLE_Z 30u    /* Z: 3.0% (sim) */
#endif
#ifndef MOTION_SIM_FRICTION_POST_RAMP_ONLY
#define MOTION_SIM_FRICTION_POST_RAMP_ONLY 1u
#endif

/* =======================
 *  Compatibilidade "progress" (interactive_old_sim)
 *  - Seleciona mestre por menor progresso (emitted/total)
 *  - Rampa guiada pelo restante do mestre (fila inclusa)
 *  - Conclusão global quando restante do mestre chega a zero
 * ======================= */
#ifndef MOTION_PROGRESS_MODE
#define MOTION_PROGRESS_MODE 1
#endif

/* =======================
 *  Throttle por erro (modo progress)
 *  - Reduz feed dos eixos não-mestres conforme |erro| cresce
 *  - Fórmula (per-mille):
 *      scale = 1 - (1 - min_frac) * min(|err|/threshold, 1)
 *      v_cmd <- v_cmd * scale
 *  - Parâmetros alinhados ao interactive_old_sim (threshold=200, min_frac=0.25)
 * ======================= */
#ifndef MOTION_ERR_THROTTLE_ENABLE
#define MOTION_ERR_THROTTLE_ENABLE 1
#endif
#ifndef MOTION_ERR_THROTTLE_THRESHOLD
#define MOTION_ERR_THROTTLE_THRESHOLD 200u /* steps */
#endif
#ifndef MOTION_ERR_THROTTLE_MIN_PERMILLE
#define MOTION_ERR_THROTTLE_MIN_PERMILLE 250u /* 0.25 => 25% do v_cmd */
#endif

// Opções de formato/rápidez (padrões conservadores p/ compatibilidade)
#ifndef MOTION_CSV_INCLUDE_ID
#define MOTION_CSV_INCLUDE_ID           0u   /* adiciona um id incremental por eixo */
#endif
#ifndef MOTION_CSV_TIME_IN_TICKS
#define MOTION_CSV_TIME_IN_TICKS        0u   /* 0=imprime tempo em ms (compat), 1=ticks TIM6 (mais barato) */
#endif
#ifndef MOTION_CSV_BIN_ITM
#define MOTION_CSV_BIN_ITM              0u   /* 1=encaminha frame binário via ITM (menos CPU/bytes) */
#endif

// Conversão de tempo baseada no clock do TIM6
// Ex.: 50 kHz => 50 ticks por milissegundo
#define T6_TICKS_PER_MS                 (MOTION_TIM6_HZ / 1000u)

// Contador monotônico de ticks do TIM6 (incrementa a cada update)
static volatile uint32_t g_tim6_ticks = 0u;

#define DEMO_ACCEL_SPS2                200000u  /* ~50 ms p/ ir a 10k sps */

/* Limite físico de passos/s com largura mínima de STEP e tLOW implícito */
#define MOTION_MIN_LOW_TICKS   ( (MOTION_STEP_LOW_TICKS) ? (MOTION_STEP_LOW_TICKS) : 1u )
#define MOTION_MAX_SPS         ( (MOTION_TIM6_HZ) / ( (MOTION_STEP_HIGH_TICKS) + (MOTION_MIN_LOW_TICKS) ) )

/* =======================
 *  Tipos/estados
 * ======================= */
typedef struct {
    uint32_t total_steps;
    uint32_t target_steps;        /* caminho fila/protocolo preservado */
    uint32_t emitted_steps;

    uint16_t velocity_per_tick;   /* ~ steps/ms (se TIM7 ~1kHz). 10 => ~10k steps/s */

    /* Ganhos PID (mantidos) */
    uint16_t kp, ki, kd;

