vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    uint8_t  step_high;           /* >0 = quantos ticks faltam em ALTO */
    uint8_t  step_low;            /* >0 = aguarda ticks em BAIXO (tLOW) */

    /* --- DDA + rampa --- */
    uint32_t dda_accum_q16;       /* acumulador de fase Q16.16 */
    uint32_t dda_inc_q16;         /* incremento por tick do TIM6 (Q16.16) */
    uint32_t v_target_sps;        /* steps/s alvo */
    uint32_t v_actual_sps;        /* steps/s efetivo com rampa */
    uint32_t accel_sps2;          /* steps/s^2 */

    uint8_t  en_settle_ticks;
        uint8_t  dir_settle_ticks;
} motion_axis_state_t;

typedef struct {
    move_queue_add_req_t req;
} motion_queue_entry_t;

enum { AXIS_X = 0, AXIS_Y = 1, AXIS_Z = 2 };
enum { MOTION_ACK_OK = 0, MOTION_ACK_INVALID = 1, MOTION_ACK_QUEUE_FULL = 2 };

/* =======================
 *  Estado global
 * ======================= */
static motion_status_t g_status;
static motion_axis_state_t g_axis_state[MOTION_AXIS_COUNT];
static volatile uint8_t g_has_active_segment = 0u;

static motion_queue_entry_t g_queue[MOTION_QUEUE_CAPACITY];
static uint8_t  g_queue_head  = 0u;
static uint8_t  g_queue_tail  = 0u;
static uint16_t g_queue_count = 0u;  /* suporta até 256 entradas */
static uint8_t g_active_frame_id = 0u; 

/* Soma dos passos restantes na FILA (exclui segmento ativo) por eixo.
 * Mantida em O(1) nos push/pop para permitir consultas rápidas no TIM6. */
static uint32_t g_queue_rem_steps[MOTION_AXIS_COUNT];

static int64_t  g_encoder_position[MOTION_AXIS_COUNT];
static uint32_t g_encoder_last_raw[MOTION_AXIS_COUNT];
static int64_t  g_encoder_origin[MOTION_AXIS_COUNT];
static int32_t  g_encoder_delta_tick[MOTION_AXIS_COUNT]; /* delta de contagens por tick TIM7 */
static int32_t  g_origin_base32[MOTION_AXIS_COUNT]; /* offset externo (origin-set) */

/* PI de velocidade baseado no encoder
 * Notas:
 *  - Ganhos kp/ki/kd recebidos via protocolo são inteiros de 16 bits.
 *  - A saída da correção é escalada por 2^-8 (>> 8) para manter estabilidade.
 */
// Ganhos inteiros (kp/ki/kd) operam em formato Q8 (>> 8). O emissor deve
// fornecer os valores já escalados. Não há multiplicação interna por 256.
// FUTURO: avaliar request alternativo com ganhos em 32 bits (ex.: escala 10^4
// como no LED em centi-Hz) ou IEEE-754, preservando o MOVE_QUEUE_ADD atual
// para compatibilidade retroativa.
#define MOTION_PI_SHIFT              8
#define MOTION_PI_I_CLAMP            (200000)
/* Limite de correção do PI: em vez de usar o máximo global,
 * aplica-se um teto dinâmico baseado no alvo de velocidade do segmento
 * com uma margem configurável (permille). Ex.: 800 => 80% do alvo. */
#ifndef MOTION_PI_MARGIN_PERMILLE
#define MOTION_PI_MARGIN_PERMILLE      800u  /* manter 20% de folga do alvo */
#endif
#define MOTION_PI_CORR_MAX_SPS       (MOTION_MAX_SPS)
// Controle PI desativado por padrão (somente telemetria)
//#ifndef MOTION_PI_ENABLE
#define MOTION_PI_ENABLE 1
//#endif

/* =======================
 *  Calibração simples (sem floats)
 * ======================= */
/*
 * Passo do motor: 0,9° => 400 passos/rotação (STEPS_PER_REV_BASE)
 * Ajuste MICROSTEP_FACTOR se o TMC estiver configurado com microstepping
 * (ex.: 16 => 6400 passos/rotação no DDA).
 */
//#ifndef MICROSTEP_FACTOR
#define MICROSTEP_FACTOR 256
//#endif
#define STEPS_PER_REV_BASE   400u
#define DDA_STEPS_PER_REV    (STEPS_PER_REV_BASE * MICROSTEP_FACTOR)

/* Encoders por rotação (fornecido / medido):
 * - Preencher X/Y/Z com os pulsos reais de cada encoder por volta.
 *   Exemplo: X/Z = 40000, Y = 5000 (ou 2500, se você medir isso na bancada).
 */
static const uint32_t ENC_COUNTS_PER_REV[3] = { 40000u, 5000u, 40000u}; // X,Y,Z

/* Microstep real do TMC em cada eixo (1,2,4,...,256) */
static volatile uint16_t g_microstep_factor[MOTION_AXIS_COUNT] = {
    MICROSTEP_FACTOR, MICROSTEP_FACTOR, MICROSTEP_FACTOR
};

/* Sinal do encoder por eixo:
 *  +1 = mesmo sentido dos steps físicos
 *  -1 = encoder montado invertido (contagem contrária ao movimento "+")
 */
static const int8_t ENC_SIGN[MOTION_AXIS_COUNT] = {
    +1, /* X normal */
    -1, /* Y invertido    */
    +1  /* Z normal    */
};

/* Quantos "steps físicos" existem em 1 volta de eixo (por eixo):
 * 400 passos base do motor (0,9°) × microstep configurado no TMC daquele eixo.
 */
static inline uint32_t control_steps_per_rev_axis(uint8_t axis)
{
    if (axis >= MOTION_AXIS_COUNT) axis = 0;
    return STEPS_PER_REV_BASE * (uint32_t)g_microstep_factor[axis];
}

/* Mantemos o alias para DDA, se em algum lugar ainda usar esse nome. */
static inline uint32_t dda_steps_per_rev_axis(uint8_t axis)
{
    return control_steps_per_rev_axis(axis);
}

/* Converte posição relativa do encoder -> steps físicos do eixo,
 * na mesma unidade de ax->target_steps / emitted_steps.
 */
static inline int32_t motion_actual_steps_from_encoder(uint8_t axis)
{
    if (axis >= MOTION_AXIS_COUNT) axis = 0;

    /* posição relativa do encoder (contagens) */
    int64_t enc_rel = g_encoder_position[axis] - g_encoder_origin[axis];

    /* converte contagens -> steps físicos:
     * actual_steps ≈ enc_rel * (400 * microstep_axis) / ENC_COUNTS_PER_REV[axis]
     */
    int64_t num = enc_rel * (int64_t)control_steps_per_rev_axis(axis);

    if (ENC_COUNTS_PER_REV[axis] == 0u) {
        return 0;
    }

    int64_t q = num / (int64_t)ENC_COUNTS_PER_REV[axis];

    if (q > (int64_t)INT32_MAX) q = (int64_t)INT32_MAX;
    else if (q < (int64_t)INT32_MIN) q = (int64_t)INT32_MIN;

    return (int32_t)q;
}

/* Deadband em passos para o PI de posição (evita tremor próximo de zero) */
#ifndef MOTION_PI_DEADBAND_STEPS
#define MOTION_PI_DEADBAND_STEPS 10
#endif

/* Derivada filtrada (para reduzir ruído do encoder no D-term) */
static int32_t g_pi_d_filt[MOTION_AXIS_COUNT];
/* Acumulador de aceleração (converter a_sps2/1000 com maior precisão) */
static uint32_t g_v_accum[MOTION_AXIS_COUNT];
static int32_t g_pi_i_accum[MOTION_AXIS_COUNT];
static int32_t g_pi_prev_err[MOTION_AXIS_COUNT];
// Sombras 32-bit para uso com SWV Data Trace/Graph
volatile int32_t g_enc_abs32[MOTION_AXIS_COUNT];
volatile int32_t g_enc_rel32[MOTION_AXIS_COUNT];

#if MOTION_DIAG_ENABLE
/* Buffers de diagnóstico (capturam valores relevantes do controle) */
static uint32_t g_dbg_v_cmd_sps[MOTION_AXIS_COUNT];
static uint32_t g_dbg_scale_pm[MOTION_AXIS_COUNT];
static int32_t  g_dbg_err[MOTION_AXIS_COUNT];
static int32_t  g_dbg_pterm[MOTION_AXIS_COUNT];
static int32_t  g_dbg_iterm[MOTION_AXIS_COUNT];
static int32_t  g_dbg_dterm[MOTION_AXIS_COUNT];
static int32_t  g_dbg_corr[MOTION_AXIS_COUNT];
static int32_t  g_dbg_v_adj[MOTION_AXIS_COUNT];
static int8_t   g_dbg_master_axis;
/* Stall detection */
static uint32_t g_diag_last_emit[MOTION_AXIS_COUNT];
static uint16_t g_diag_no_step_ms[MOTION_AXIS_COUNT];
static uint8_t  g_diag_stall_reported[MOTION_AXIS_COUNT];
static uint32_t g_diag_next_print_ms;
/* Bugcheck pontual */
static uint8_t  g_bugcheck_reported[MOTION_AXIS_COUNT];
#endif

// Telemetria CSV: tempo(ms) desde início da variação do encoder,
// posição relativa do encoder e total de passos emitidos desde o início
static volatile uint8_t  g_csv_active[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_t0_ms[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_stepcount[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_next_ms[MOTION_AXIS_COUNT];
static volatile uint8_t  g_csv_armed[MOTION_AXIS_COUNT]; // 1=armado no start_move; ativa ao primeiro STEP

// Referência de tempo baseada em ticks do TIM6 (mais estável que SysTick em prints SWO)
static volatile uint32_t g_csv_t0_t6[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_next_t6[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_seq[MOTION_AXIS_COUNT]; /* id incremental por eixo */

#if MOTION_CSV_PRODUCE_IN_TIM6
typedef struct {
    uint32_t id;      /* id incremental */
    uint32_t t6;      /* tempo relativo em ticks do TIM6 */
    int32_t  rel;     /* encoder relativo */
    uint32_t steps;   /* total de steps emitidos */
} motion_csv_sample_t;

static volatile motion_csv_sample_t g_csv_ring[MOTION_AXIS_COUNT][MOTION_CSV_RING_CAP];
static volatile uint16_t g_csv_rhead[MOTION_AXIS_COUNT];
static volatile uint16_t g_csv_rtail[MOTION_AXIS_COUNT];
static volatile uint32_t g_csv_next_prod_t6; /* agenda global: a cada 50 ticks (1ms) */

static inline void csv_ring_reset(void)
{
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
        g_csv_rhead[a] = 0u;
        g_csv_rtail[a] = 0u;
    }
    g_csv_next_prod_t6 = 0u;
}

static inline void csv_ring_push(uint8_t axis, uint32_t id, uint32_t t6, int32_t rel, uint32_t steps)
{
    uint16_t h = g_csv_rhead[axis];
    uint16_t n = (uint16_t)((h + 1u) % MOTION_CSV_RING_CAP);
    if (n == g_csv_rtail[axis]) {
        /* ring cheio: descarta o mais antigo (avança tail) para não bloquear produtor */
        g_csv_rtail[axis] = (uint16_t)((g_csv_rtail[axis] + 1u) % MOTION_CSV_RING_CAP);
    }
    g_csv_ring[axis][h].id    = id;
    g_csv_ring[axis][h].t6    = t6;
    g_csv_ring[axis][h].rel   = rel;
    g_csv_ring[axis][h].steps = steps;
    g_csv_rhead[axis] = n;
}

static inline int csv_ring_pop(uint8_t axis, motion_csv_sample_t *out)
{
    uint16_t t = g_csv_rtail[axis];
    if (t == g_csv_rhead[axis]) return 0;
    if (out) {
        * (motion_csv_sample_t*)out = g_csv_ring[axis][t];
    }
    g_csv_rtail[axis] = (uint16_t)((t + 1u) % MOTION_CSV_RING_CAP);
    return 1;
}
#endif /* MOTION_CSV_PRODUCE_IN_TIM6 */

