vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
#if MOTION_SIM_FRICTION_ENABLE
static volatile uint8_t  g_sim_friction_active = 0u;
static volatile uint8_t  g_sim_friction_axis   = (uint8_t)MOTION_SIM_FRICTION_AXIS_DEFAULT;
static volatile uint16_t g_sim_friction_c_sps  = (uint16_t)MOTION_SIM_FRICTION_C_SPS;
static volatile uint16_t g_sim_friction_b_pm   = (uint16_t)MOTION_SIM_FRICTION_B_PERMILLE;
static volatile uint8_t  g_sim_friction_post_ramp = (uint8_t)MOTION_SIM_FRICTION_POST_RAMP_ONLY;
static volatile uint8_t  g_sim_ramp_done[MOTION_AXIS_COUNT] = {0,0,0};
static uint16_t g_sim_initial_items = 0u;   /* itens na fila (inclui ativo) no start_move */
static uint16_t g_sim_processed_items = 0u; /* quantos segmentos já iniciaram */
#endif

// Forward declarations for lock helpers used below
static inline uint32_t motion_lock(void);
static inline void     motion_unlock(uint32_t primask);

// Checagem local de habilitação do SWO/ITM (porta 0)
static inline int motion_swo_enabled(void)
{
    return ((CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk) &&
            (DBGMCU->CR & DBGMCU_CR_TRACE_IOEN) &&
            (ITM->TCR & ITM_TCR_ITMENA_Msk) &&
            (ITM->TER & (1UL << 0)));
}

static inline void motion_csv_print(uint8_t axis, uint32_t id, uint32_t t_val, int32_t rel, uint32_t steps)
{
#if MOTION_CSV_BIN_ITM
    // Frame binário compacto: [tag(1) axis(1) id(4) t(4) rel(4) steps(4)]
    // tag='E' (0x45) para encoder; axis=0..2
    if (motion_swo_enabled()) {
        ITM_SendChar('E');
        ITM_SendChar((uint32_t)axis);
        uint32_t v;
        v = id;      for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = t_val;   for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = (uint32_t)rel; for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = steps;   for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        ITM_SendChar('\n');
        return;
    }
#endif

#if MOTION_CSV_TEXT_ENABLE
#if MOTION_CSV_INCLUDE_ID
    // Texto: axis,id,time,rel,steps (rel como int32 para evitar wrap sem sinal)
    printf("%u,%lu,%lu,%d,%lu\r\n",
           (unsigned)axis,
           (unsigned long)id,
           (unsigned long)t_val,
           (int)rel,
           (unsigned long)steps);
#else
    // Compatibilidade: axis,time,rel,steps
    printf("%u,%lu,%d,%lu\r\n",
           (unsigned)axis,
           (unsigned long)t_val,
           (int)rel,
           (unsigned long)steps);
#endif
#endif /* MOTION_CSV_TEXT_ENABLE */
}

static uint32_t g_step_print_count[MOTION_AXIS_COUNT] = {0,0,0};

static volatile uint8_t g_demo_continuous = 0u; /* 1 = gera passos continuamente (modo DEMO) */
static const uint16_t  g_demo_speed_table[4] = { 5u, 10u, 20u, 40u }; /* ksteps/s aprox (TIM7 ~1kHz) */
static volatile uint8_t g_demo_speed_idx = 1u;

/* =======================
 *  Helpers de lock
 * ======================= */
static inline uint32_t motion_lock(void) {
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    return primask;
}
static inline void motion_unlock(uint32_t primask) {
    __set_PRIMASK(primask);
}

/* Forward decl. para função usada pela seleção de mestre (progress) */
static uint32_t motion_remaining_steps_total_for_axis(uint8_t axis);

/* =======================
 *  Seleção de Mestre (modo progress)
 * ======================= */
#if MOTION_PROGRESS_MODE
static inline int8_t motion_select_master_axis_progress(void)
{
    int8_t master = -1;
    uint32_t m_num = 0u, m_den = 1u;

    /* 1) Preferir o menor progresso ENTRE eixos que ainda têm trabalho (ativo+fila)
          e que participam do segmento atual (total_steps>0). */
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        /* total restante (ativo + fila) em O(1) */
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t active = (ax->total_steps > ax->emitted_steps)
                          ? (ax->total_steps - ax->emitted_steps) : 0u;
        uint32_t rem_total = active + g_queue_rem_steps[axis];
        if (rem_total == 0u) continue; /* não escolher quem já acabou de vez */
        if (ax->total_steps == 0u) continue; /* não participa do segmento atual */

        uint32_t num = ax->emitted_steps; /* progresso acumulado */
        uint32_t den = ax->total_steps;   /* tamanho do segmento */
        if (master < 0) { master = (int8_t)axis; m_num = num; m_den = den; }
        else if ((uint64_t)num * (uint64_t)m_den < (uint64_t)m_num * (uint64_t)den) {
            master = (int8_t)axis; m_num = num; m_den = den;
        }
    }

    /* 2) Fallback: se ninguém do segmento atual tem rem_total>0, escolha
          o eixo com MAIOR rem_total geral (apontando para o próximo da fila). */
    if (master < 0) {
        uint32_t best_rem = 0u;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            uint32_t active = (ax->total_steps > ax->emitted_steps)
                              ? (ax->total_steps - ax->emitted_steps) : 0u;
            uint32_t rem_total = active + g_queue_rem_steps[axis];
            if (rem_total > best_rem) { best_rem = rem_total; master = (int8_t)axis; }
        }
    }

    return master;
}
#endif /* MOTION_PROGRESS_MODE */

#if MOTION_DIAG_ENABLE
/* =======================
 *  Diagnóstico: snapshots e detecção de stall
 * ======================= */
static inline void motion_diag_tick(void)
{
    /* Atualiza contadores de "sem passo" por eixo (1ms por tick TIM7) */
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint8_t expected = (g_status.state == MOTION_RUNNING) && g_has_active_segment && (ax->total_steps > ax->emitted_steps);
        if (!expected) {
            g_diag_no_step_ms[axis] = 0u;
            g_diag_last_emit[axis]  = ax->emitted_steps;
            g_diag_stall_reported[axis] = 0u;
            continue;
        }
        if (ax->emitted_steps == g_diag_last_emit[axis]) {
            if (g_diag_no_step_ms[axis] < 0xFFFFu) g_diag_no_step_ms[axis]++;
        } else {
            g_diag_no_step_ms[axis] = 0u;
            g_diag_last_emit[axis]  = ax->emitted_steps;
            g_diag_stall_reported[axis] = 0u;
        }
    }

    /* Evento de STALL: nenhum passo por MOTION_DIAG_STALL_MS enquanto ainda há trabalho */
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t active_rem = (ax->total_steps > ax->emitted_steps) ? (ax->total_steps - ax->emitted_steps) : 0u;
        if (active_rem == 0u) continue;
        if (g_diag_no_step_ms[axis] >= (uint16_t)MOTION_DIAG_STALL_MS && !g_diag_stall_reported[axis]) {
            /* Snapshot compacto com variáveis que podem bloquear geração de passos */
            int32_t enc_rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
            int32_t actual  = motion_actual_steps_from_encoder(axis);
            printf("[STALL axis=%u] rem=%lu v_cmd=%lu v_act=%lu incQ16=%lu high=%u low=%u en_set=%u dir_set=%u err=%ld p=%ld i=%ld d=%ld corr=%ld v_adj=%ld ms=%u qdepth=%u actv=%u\r\n",
                   (unsigned)axis,
                   (unsigned long)active_rem,
                   (unsigned long)g_dbg_v_cmd_sps[axis],
                   (unsigned long)ax->v_actual_sps,
                   (unsigned long)ax->dda_inc_q16,
                   (unsigned)ax->step_high,
                   (unsigned)ax->step_low,
                   (unsigned)ax->en_settle_ticks,
                   (unsigned)ax->dir_settle_ticks,
                   (long)g_dbg_err[axis],
                   (long)g_dbg_pterm[axis],
                   (long)g_dbg_iterm[axis],
                   (long)g_dbg_dterm[axis],
                   (long)g_dbg_corr[axis],
                   (long)g_dbg_v_adj[axis],
                   (unsigned)g_diag_no_step_ms[axis],
                   (unsigned)g_status.queue_depth,
                   (unsigned)g_has_active_segment);
            printf("[STALL axis=%u] enc_rel=%ld actual_steps=%ld ms_factor=%u enc_cpr=%lu scale_pm=%lu master=%d\r\n",
                   (unsigned)axis,
                   (long)enc_rel,
                   (long)actual,
                   (unsigned)g_microstep_factor[axis],
                   (unsigned long)ENC_COUNTS_PER_REV[axis],
                   (unsigned long)g_dbg_scale_pm[axis],
                   (int)g_dbg_master_axis);
            g_diag_stall_reported[axis] = 1u; /* evita flood até próximo passo */
        }
    }

    /* Bugcheck pontual: rem>0 && v_cmd==0 && fila>0 */
#if MOTION_BUGCHECK_ENABLE
    {
        uint8_t active_mask = 0u;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            if (ax->total_steps > ax->emitted_steps) active_mask |= (1u << axis);
        }
        uint16_t qdepth = g_queue_count; /* somente fila (exclui ativo) */
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            uint32_t active_rem = (ax->total_steps > ax->emitted_steps) ? (ax->total_steps - ax->emitted_steps) : 0u;
            uint32_t rem_total = active_rem + g_queue_rem_steps[axis];
            if (rem_total > 0u && g_dbg_v_cmd_sps[axis] == 0u && qdepth > 0u) {
                if (!g_bugcheck_reported[axis]) {
                    g_bugcheck_reported[axis] = 1u;
                    printf("[BUG axis=%u] rem=%lu v_cmd=0 qdepth=%u mask=0x%02X\r\n",
                           (unsigned)axis,
                           (unsigned long)rem_total,
                           (unsigned)qdepth,
                           (unsigned)active_mask);
                }
            } else {
                g_bugcheck_reported[axis] = 0u; /* libera nova emissão quando sair da condição */
            }
        }
    }
#endif

    /* Log periódico opcional */
    uint32_t now_ms = g_tim6_ticks / (uint32_t)T6_TICKS_PER_MS;
    if ((int32_t)(now_ms - g_diag_next_print_ms) >= 0) {
        g_diag_next_print_ms = now_ms + (uint32_t)MOTION_DIAG_INTERVAL_MS;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            uint32_t active_rem = (ax->total_steps > ax->emitted_steps) ? (ax->total_steps - ax->emitted_steps) : 0u;
            printf("[DIAG axis=%u] state=%u actv=%u rem=%lu v_cmd=%lu v_act=%lu incQ16=%lu hi=%u lo=%u en=%u dir=%u err=%ld scale_pm=%lu\r\n",
                   (unsigned)axis,
                   (unsigned)g_status.state,
                   (unsigned)g_has_active_segment,
                   (unsigned long)active_rem,
                   (unsigned long)g_dbg_v_cmd_sps[axis],
                   (unsigned long)ax->v_actual_sps,
                   (unsigned long)ax->dda_inc_q16,
                   (unsigned)ax->step_high,
                   (unsigned)ax->step_low,
                   (unsigned)ax->en_settle_ticks,
                   (unsigned)ax->dir_settle_ticks,
                   (long)g_dbg_err[axis],
                   (unsigned long)g_dbg_scale_pm[axis]);
            /* Linha detalhada opcional (p/i/d/corr/v_adj) */
#if MOTION_DIAG_VERBOSE
            printf("[DIAG axis=%u] p=%ld i=%ld d=%ld corr=%ld v_adj=%ld\r\n",
                   (unsigned)axis,
                   (long)g_dbg_pterm[axis],
                   (long)g_dbg_iterm[axis],
                   (long)g_dbg_dterm[axis],
                   (long)g_dbg_corr[axis],
                   (long)g_dbg_v_adj[axis]);
#endif
        }
    }
}
#endif /* MOTION_DIAG_ENABLE */
/* =======================
 *  Helpers de acesso por eixo
 * ======================= */
static inline uint32_t motion_total_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->sx;
        case AXIS_Y: return req->sy;
        case AXIS_Z:
        default:     return req->sz;
    }
}

static inline uint16_t motion_velocity_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->vx;
        case AXIS_Y: return req->vy;
        case AXIS_Z:
        default:     return req->vz;
    }
}

static inline uint16_t motion_kp_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->kp_x;
        case AXIS_Y: return req->kp_y;
        case AXIS_Z:
        default:     return req->kp_z;
    }
}

