vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
static inline uint16_t motion_ki_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->ki_x;
        case AXIS_Y: return req->ki_y;
        case AXIS_Z:
        default:     return req->ki_z;
    }
}

static inline uint16_t motion_kd_for_axis(const move_queue_add_req_t *req, uint8_t axis) {
    switch (axis) {
        case AXIS_X: return req->kd_x;
        case AXIS_Y: return req->kd_y;
        case AXIS_Z:
        default:     return req->kd_z;
    }
}

static inline int8_t motion_clamp_error(int32_t value) {
    if (value > 127)  return 127;
    if (value < -128) return -128;
    return (int8_t)value;
}

/* Soma restante (em passos) no eixo, incluindo segmento ativo + fila
 * Usado para decidir desaceleração suave no final da lista de movimentos. */
static uint32_t motion_remaining_steps_total_for_axis(uint8_t axis)
{
    uint32_t rem = 0u;
    if (axis < MOTION_AXIS_COUNT) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        if (ax->total_steps > ax->emitted_steps)
            rem += (ax->total_steps - ax->emitted_steps);
    }
    for (uint16_t i = 0; i < g_queue_count; ++i) {
        uint8_t idxq = (uint8_t)(((uint16_t)g_queue_head + i) % MOTION_QUEUE_CAPACITY);
        const move_queue_add_req_t *q = &g_queue[idxq].req;
        rem += motion_total_for_axis(q, axis);
    }
    return rem;
}

/* =======================
 *  Status e fila
 * ======================= */
static void motion_refresh_status_locked(void) {
    /* depth reportado cabe em 8 bits; faz clamp para 255 */
    uint32_t depth32 = (uint32_t)g_queue_count + (uint32_t)(g_has_active_segment ? 1u : 0u);
    if (depth32 > 255u) depth32 = 255u;
    g_status.queue_depth = (uint8_t)depth32;

    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t total = ax->total_steps;
        uint32_t emitted = ax->emitted_steps;
        uint8_t pct = 0u;

        if (g_has_active_segment && total > 0u) {
            uint64_t scaled = (uint64_t)emitted * 100u;
            pct = (uint8_t)(scaled / total);
            if (pct > 100u) pct = 100u;
        } else if (total == 0u && g_has_active_segment) {
            pct = 100u;
        } else if (!g_has_active_segment && total > 0u) {
            pct = (emitted >= total) ? 100u : (uint8_t)(((uint64_t)emitted * 100u) / total);
        }

        /* Erro em UNIDADES DE STEPS FÍSICOS
         * desired_steps = passos emitidos no segmento (target_steps)
         * actual_steps  = encoder convertido para steps físicos do eixo
         */
        int32_t actual_steps  = motion_actual_steps_from_encoder(axis);
        int32_t desired_steps = (int32_t)ax->target_steps;
        int32_t err           = desired_steps - actual_steps;
        int8_t  err8          = motion_clamp_error(err);

        switch (axis) {
            case AXIS_X: g_status.pctX = pct; g_status.pidErrX = err8; break;
            case AXIS_Y: g_status.pctY = pct; g_status.pidErrY = err8; break;
            case AXIS_Z:
            default:     g_status.pctZ = pct; g_status.pidErrZ = err8; break;
        }
    }
}


static void motion_stop_all_axes_locked(void) {
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        motion_hw_step_low(axis);
        motion_hw_enable(axis, 0u);

        motion_axis_state_t *ax = &g_axis_state[axis];
        ax->total_steps       = 0u;
        ax->target_steps      = 0u;
        ax->emitted_steps     = 0u;

        ax->velocity_per_tick = 0u;
        ax->kp = 0u; ax->ki = 0u; ax->kd = 0u;

        /* limpa controle de pulso/guardas */
        ax->step_high         = 0u;
        ax->step_low          = 0u;
        ax->en_settle_ticks   = 0u;
        ax->dir_settle_ticks  = 0u;

        /* limpa DDA/rampa */
        ax->dda_accum_q16     = 0u;
        ax->dda_inc_q16       = 0u;
        ax->v_target_sps      = 0u;
        ax->v_actual_sps      = 0u;
        ax->accel_sps2        = 0u;
    }
}


static void motion_queue_clear_locked(void) {
    g_queue_head = 0u;
    g_queue_tail = 0u;
    g_queue_count = 0u;
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_queue_rem_steps[a] = 0u;
}

static proto_result_t motion_queue_push_locked(const move_queue_add_req_t *req) {
    if (g_queue_count >= MOTION_QUEUE_CAPACITY)
        return PROTO_ERR_RANGE;
    g_queue[g_queue_tail].req = *req;
    g_queue_tail = (uint8_t)((g_queue_tail + 1u) % MOTION_QUEUE_CAPACITY);
    ++g_queue_count;
    /* Atualiza soma de passos restantes na FILA (por eixo) */
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
        g_queue_rem_steps[a] += motion_total_for_axis(req, a);
    }
    motion_refresh_status_locked();
    return PROTO_OK;
}

static int motion_queue_pop_locked(move_queue_add_req_t *out) {
    if (g_queue_count == 0u) return 0;
    move_queue_add_req_t tmp = g_queue[g_queue_head].req;
    if (out) *out = tmp;
    g_queue_head = (uint8_t)((g_queue_head + 1u) % MOTION_QUEUE_CAPACITY);
    --g_queue_count;
    /* Remove da soma de fila aquilo que saiu da fila */
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
        uint32_t s = motion_total_for_axis(&tmp, a);
        if (g_queue_rem_steps[a] >= s) g_queue_rem_steps[a] -= s;
        else g_queue_rem_steps[a] = 0u;
    }
    return 1;
}

static void motion_begin_segment_locked(const move_queue_add_req_t *seg) {
    if (!seg) return;

    g_has_active_segment = 1u;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t total   = motion_total_for_axis(seg, axis);
        uint16_t velTick = motion_velocity_for_axis(seg, axis);

        ax->total_steps       = total;
        ax->target_steps      = 0u;
        ax->emitted_steps     = 0u;

        ax->velocity_per_tick = velTick;
        ax->kp = motion_kp_for_axis(seg, axis);
        ax->ki = motion_ki_for_axis(seg, axis);
        ax->kd = motion_kd_for_axis(seg, axis);

        /* guardas para atender DIR/ENABLE timings do TMC5160 */
        ax->step_high         = 0u;
        ax->step_low          = 0u; 
        ax->en_settle_ticks   = (total > 0u) ? MOTION_ENABLE_SETTLE_TICKS : 0u;
        ax->dir_settle_ticks  = MOTION_DIR_SETUP_TICKS;

        ax->dda_accum_q16     = 0u;
        ax->dda_inc_q16       = 0u;
        ax->v_target_sps      = ((uint32_t)velTick) * 1000u;  /* steps/s alvo (derivado do seu campo) */
        if (ax->v_target_sps > MOTION_MAX_SPS) ax->v_target_sps = MOTION_MAX_SPS;
        /* Preserva v_actual_sps ao encadear segmentos (rampa só no início da lista) */
        if (g_status.state != MOTION_RUNNING) {
            ax->v_actual_sps  = 0u;
        }
        ax->accel_sps2        = DEMO_ACCEL_SPS2;

        motion_hw_step_low(axis);
        motion_hw_set_dir(axis, (uint8_t)((seg->dirMask >> axis) & 0x1u));

        if (total > 0u) motion_hw_enable(axis, 1u);
        else            motion_hw_enable(axis, 0u);

        /* Não zera origem automaticamente; mantém a referência definida via set_origin */
        g_encoder_delta_tick[axis] = 0;
        g_pi_i_accum[axis] = 0;
        g_pi_prev_err[axis] = 0;
    }
#if MOTION_DEBUG_GAINS_PRINT
    /* Imprime ganhos PID aplicados para todos os eixos (inteiros do firmware) */
    printf("[PID] Kp=(%u,%u,%u) Ki=(%u,%u,%u) Kd=(%u,%u,%u)\r\n",
           (unsigned)g_axis_state[AXIS_X].kp, (unsigned)g_axis_state[AXIS_Y].kp, (unsigned)g_axis_state[AXIS_Z].kp,
           (unsigned)g_axis_state[AXIS_X].ki, (unsigned)g_axis_state[AXIS_Y].ki, (unsigned)g_axis_state[AXIS_Z].ki,
           (unsigned)g_axis_state[AXIS_X].kd, (unsigned)g_axis_state[AXIS_Y].kd, (unsigned)g_axis_state[AXIS_Z].kd);
#endif
#if MOTION_SIM_FRICTION_ENABLE && MOTION_SIM_FRICTION_AUTO_HALF
    /* Conta segmentos processados e ativa atrito ao chegar no meio da fila */
    g_sim_processed_items++;
    uint16_t half = (uint16_t)((g_sim_initial_items + 1u) / 2u);
    if (!g_sim_friction_active && half > 0u && g_sim_processed_items >= half) {
        g_sim_friction_active = 1u;
        printf("[FRIC] auto_half: axis=%u C=%u Bpm=%u\r\n",
               (unsigned)g_sim_friction_axis, (unsigned)g_sim_friction_c_sps, (unsigned)g_sim_friction_b_pm);
    }
#endif
#if MOTION_DEBUG_FLOW
    printf("[FLOW begin_segment id=%u dirMask=0x%02X V(x,y,z)=(%u,%u,%u) S(x,y,z)=(%lu,%lu,%lu) ]\r\n",
           (unsigned)seg->frameId,
           (unsigned)seg->dirMask,
           (unsigned)seg->vx, (unsigned)seg->vy, (unsigned)seg->vz,
           (unsigned long)motion_total_for_axis(seg, AXIS_X),
           (unsigned long)motion_total_for_axis(seg, AXIS_Y),
           (unsigned long)motion_total_for_axis(seg, AXIS_Z));
#endif
}

