vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
static uint8_t motion_try_start_next_locked(void) {
    move_queue_add_req_t next;
    if (!motion_queue_pop_locked(&next))
        return 0u;
    motion_begin_segment_locked(&next);
    g_active_frame_id = next.frameId;
#if MOTION_DEBUG_FLOW
    printf("[FLOW pop_next id=%u remaining=%u]\r\n", (unsigned)g_active_frame_id, (unsigned)g_queue_count);
#endif
    return 1u;
}

/* =======================
 *  Encoders
 * ======================= */
static void motion_update_encoders(void) {
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        uint32_t now = motion_hw_encoder_read_raw(axis);
        uint8_t bits = motion_hw_encoder_bits(axis);
        int32_t delta_signed;
        if (bits == 16u) {
            uint16_t prev = (uint16_t)g_encoder_last_raw[axis];
            int16_t delta16 = (int16_t)((uint16_t)now - prev);
            g_encoder_last_raw[axis] = (uint16_t)now;
            delta_signed = (int32_t)delta16;
        } else {
            delta_signed = (int32_t)(now - g_encoder_last_raw[axis]);
            g_encoder_last_raw[axis] = now;
        }

        /* aplica o fator de sinal do encoder */
        delta_signed *= (int32_t)ENC_SIGN[axis];

        g_encoder_position[axis]   += delta_signed;
        g_encoder_delta_tick[axis]  = delta_signed;
    }
}

/* =======================
 *  Envio de respostas
 * ======================= */
static void motion_send_queue_add_ack(uint8_t frame_id, uint8_t status) {
    uint8_t raw[6];
    move_queue_add_ack_resp_t resp = { frame_id, status };
    if (move_queue_add_ack_resp_encoder(&resp, raw, sizeof raw) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "ack", "encode_fail");
        return;
    }
    if (app_resp_push(raw, (uint32_t)sizeof raw) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "ack", "queue_full");
    }
}

static void motion_send_queue_status_response(uint8_t frame_id) {
    uint8_t raw[12];
    move_queue_status_resp_t resp = {
        .frameId = frame_id,
        .status  = (uint8_t)g_status.state,
        .pidErrX = (uint8_t)g_status.pidErrX,
        .pidErrY = (uint8_t)g_status.pidErrY,
        .pidErrZ = (uint8_t)g_status.pidErrZ,
        .pctX    = g_status.pctX,
        .pctY    = g_status.pctY,
        .pctZ    = g_status.pctZ,
    };
    if (move_queue_status_resp_encoder(&resp, raw, sizeof raw) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "status", "encode_fail");
        return;
    }
    if (app_resp_push(raw, (uint32_t)sizeof raw) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "status", "queue_full");
    }
}

static void motion_send_start_response(uint8_t frame_id, uint8_t status, uint8_t depth) {
    uint8_t raw[6];
    start_move_resp_t resp; resp.frameId = frame_id; resp.status = status; resp.depth = depth;
    if (start_move_resp_encoder(&resp, raw, sizeof raw) != PROTO_OK) return;
    if (app_resp_push(raw, (uint32_t)sizeof raw) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "start", "resp_queue_full");
    }
}

static void motion_send_move_end_response(uint8_t frame_id, uint8_t status) {
    uint8_t raw[5];
    move_end_resp_t resp; resp.frameId = frame_id; resp.status = status;
    if (move_end_resp_encoder(&resp, raw, sizeof raw) != PROTO_OK) return;
    if (app_resp_push(raw, (uint32_t)sizeof raw) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "move_end", "resp_queue_full");
    }
}


/* =======================
 *  Init
 * ======================= */
void motion_service_init(void) {
    uint32_t primask = motion_lock();

    memset(&g_status, 0, sizeof g_status);
    memset(g_axis_state, 0, sizeof g_axis_state);
    memset(g_queue, 0, sizeof g_queue);
    memset(g_encoder_position, 0, sizeof g_encoder_position);
    memset(g_encoder_last_raw, 0, sizeof g_encoder_last_raw);
    memset(g_encoder_origin, 0, sizeof g_encoder_origin);
    memset(g_encoder_delta_tick, 0, sizeof g_encoder_delta_tick);
    memset(g_pi_i_accum, 0, sizeof g_pi_i_accum);
    memset(g_pi_prev_err, 0, sizeof g_pi_prev_err);
    memset(g_origin_base32, 0, sizeof g_origin_base32);
    memset(g_pi_d_filt, 0, sizeof g_pi_d_filt);
    memset(g_v_accum, 0, sizeof g_v_accum);
#if MOTION_DIAG_ENABLE
    memset(g_dbg_v_cmd_sps, 0, sizeof g_dbg_v_cmd_sps);
    memset(g_dbg_scale_pm, 0, sizeof g_dbg_scale_pm);
    memset(g_dbg_err, 0, sizeof g_dbg_err);
    memset(g_dbg_pterm, 0, sizeof g_dbg_pterm);
    memset(g_dbg_iterm, 0, sizeof g_dbg_iterm);
    memset(g_dbg_dterm, 0, sizeof g_dbg_dterm);
    memset(g_dbg_corr, 0, sizeof g_dbg_corr);
    memset(g_dbg_v_adj, 0, sizeof g_dbg_v_adj);
    g_dbg_master_axis = -1;
    memset(g_diag_last_emit, 0, sizeof g_diag_last_emit);
    memset(g_diag_no_step_ms, 0, sizeof g_diag_no_step_ms);
    memset(g_diag_stall_reported, 0, sizeof g_diag_stall_reported);
    g_diag_next_print_ms = 0u;
    memset(g_bugcheck_reported, 0, sizeof g_bugcheck_reported);
#endif
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_queue_rem_steps[a] = 0u;
    memset((void*)g_csv_active, 0, sizeof g_csv_active);
    memset((void*)g_csv_t0_ms, 0, sizeof g_csv_t0_ms);
    memset((void*)g_csv_stepcount, 0, sizeof g_csv_stepcount);
    memset((void*)g_csv_next_ms, 0, sizeof g_csv_next_ms);
    memset((void*)g_csv_armed, 0, sizeof g_csv_armed);
    memset((void*)g_csv_t0_t6, 0, sizeof g_csv_t0_t6);
    memset((void*)g_csv_next_t6, 0, sizeof g_csv_next_t6);
    memset((void*)g_csv_seq, 0, sizeof g_csv_seq);
    g_tim6_ticks = 0u;
#if MOTION_CSV_PRODUCE_IN_TIM6
    csv_ring_reset();
#endif

    g_status.state = MOTION_IDLE;
    g_queue_head = g_queue_tail = g_queue_count = 0u;
    g_has_active_segment = 0u;

    motion_stop_all_axes_locked();
    motion_refresh_status_locked();
    motion_unlock(primask);

    motion_hw_init();

    /* Debug: imprime configuração do encoder do eixo Y (LPTIM1) */
#if MOTION_DEBUG_ENCODERS
    {
        const char *pol_str = "?";
        const char *xmode_str = "?";
#ifdef LPTIM_CLOCKPOLARITY_RISING
        if (hlptim1.Init.UltraLowPowerClock.Polarity == LPTIM_CLOCKPOLARITY_RISING) {
            pol_str = "RISING"; xmode_str = "1x";
        }
#endif
#ifdef LPTIM_CLOCKPOLARITY_FALLING
        if (hlptim1.Init.UltraLowPowerClock.Polarity == LPTIM_CLOCKPOLARITY_FALLING) {
            pol_str = "FALLING"; xmode_str = "1x";
        }
#endif
#ifdef LPTIM_CLOCKPOLARITY_RISING_FALLING
        if (hlptim1.Init.UltraLowPowerClock.Polarity == LPTIM_CLOCKPOLARITY_RISING_FALLING) {
            pol_str = "RISING_FALLING"; xmode_str = "2x";
        }
#endif
        printf("[ENC_Y] bits=%u ENC_COUNTS_PER_REV=%lu microstep=%u pol=%s (modo %s)\r\n",
               (unsigned)motion_hw_encoder_bits(AXIS_Y),
               (unsigned long)ENC_COUNTS_PER_REV[AXIS_Y],
               (unsigned)g_microstep_factor[AXIS_Y],
               pol_str, xmode_str);
    }
#endif

    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        uint32_t raw = motion_hw_encoder_read_raw(axis);
        if (motion_hw_encoder_bits(axis) == 16u) {
            g_encoder_last_raw[axis] = raw & 0xFFFFu;
        } else {
            g_encoder_last_raw[axis] = raw;
        }
    }

    if (HAL_TIM_Base_Start_IT(&htim6) != HAL_OK) Error_Handler();
    if (HAL_TIM_Base_Start_IT(&htim7) != HAL_OK) Error_Handler();

    LOGT_THIS(LOG_STATE_START, PROTO_OK, "init", "timers_ready");
#if MOTION_SIM_FRICTION_ENABLE
    printf("[FRIC] feature=on axis=%u C=%u Bpm=%u post_ramp=%u\r\n",
           (unsigned)g_sim_friction_axis,
           (unsigned)g_sim_friction_c_sps,
           (unsigned)g_sim_friction_b_pm,
           (unsigned)g_sim_friction_post_ramp);
#endif
}

