vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    uint32_t primask = motion_lock();
    if (g_has_active_segment) {
        uint8_t confirm = 1u;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            if (ax->emitted_steps < ax->total_steps || ax->step_high) {
                confirm = 0u; break;
            }
        }
#if MOTION_PROGRESS_MODE
        /* Confirmar término apenas quando não houver trabalho (ativo+fila)
           em NENHUM eixo. Usa soma O(1) por eixo (ativo + fila acumulada). */
        if (!confirm) {
            uint32_t rem_all = 0u;
            for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
                const motion_axis_state_t *ax = &g_axis_state[a];
                uint32_t active = (ax->total_steps > ax->emitted_steps)
                                  ? (ax->total_steps - ax->emitted_steps) : 0u;
                rem_all += active + g_queue_rem_steps[a];
            }
            if (rem_all == 0u) {
                confirm = 1u;
            }
        }
#endif
        if (confirm) {
            if (motion_try_start_next_locked()) {
                g_status.state = MOTION_RUNNING;
#if MOTION_DEBUG_FLOW
                printf("[FLOW next_segment started]\r\n");
#endif
            } else {
                g_has_active_segment = 0u;
                motion_stop_all_axes_locked();
                g_status.state = MOTION_DONE;
                motion_send_move_end_response(g_active_frame_id, 0u /* natural_done */);
                // Fim do movimento: encerrar sessão CSV e zerar contadores
        for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
            g_csv_active[a] = 0u;
            g_csv_armed[a]  = 0u;
            g_csv_stepcount[a] = 0u;
            g_csv_seq[a] = 0u;
        }
            }
            motion_refresh_status_locked();
        }
    }
    motion_unlock(primask);
}

/* =======================
 *  Tick do TIM7 (~1 kHz)
 *  - Atualiza encoders
 *  - DEMO: rampa e dda_inc
 *  - Fila: sua original de target_steps
 * ======================= */
void motion_on_tim7_tick(void)
{
    motion_update_encoders();

    /* Debug: imprime encoder a cada N pulsos (por eixo via máscara) */
#if MOTION_DEBUG_ENCODERS && MOTION_ENC_PRINT_EVERY_N_ENABLE
    {
        static int32_t last_print_rel[3] = { INT32_MIN, INT32_MIN, INT32_MIN };
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            if ((MOTION_ENC_PRINT_MASK & (1u << axis)) == 0u) continue;
            int32_t d = g_encoder_delta_tick[axis];
            if (d == 0) continue;
            int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
            int32_t absrel = (rel < 0) ? -rel : rel;
            if (MOTION_ENC_PRINT_N > 0u && (absrel % (int32_t)MOTION_ENC_PRINT_N) == 0 && rel != last_print_rel[axis]) {
                last_print_rel[axis] = rel;
                char axch = (char)('X' + axis);
                printf("[ENC_%c+%u] rel=%ld delta=%ld\r\n", axch, (unsigned)MOTION_ENC_PRINT_N, (long)rel, (long)d);
            }
        }
    }
#endif

#if (MOTION_CSV_SAMPLE_MS + 0u) > 0u && !MOTION_CSV_PRODUCE_IN_TIM6
    // Emite CSV (axis,time,rel,steps) periodicamente usando base de tempo do TIM6
    uint32_t now_t6 = g_tim6_ticks;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        if (!g_csv_active[axis]) continue;
        if ((int32_t)(now_t6 - g_csv_next_t6[axis]) >= 0) {
            int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
            uint32_t dt_t6 = now_t6 - g_csv_t0_t6[axis];
#if MOTION_CSV_TIME_IN_TICKS
            uint32_t t_val = dt_t6;
#else
            uint32_t t_val = dt_t6 / T6_TICKS_PER_MS;
#endif
            uint32_t pm = motion_lock();
            uint32_t id = ++g_csv_seq[axis];
            motion_unlock(pm);
            motion_csv_print(axis, id, t_val, rel, g_csv_stepcount[axis]);
            uint32_t inc_ticks = ((uint32_t)MOTION_CSV_SAMPLE_MS) * (uint32_t)T6_TICKS_PER_MS;
            do { g_csv_next_t6[axis] += inc_ticks; } while ((int32_t)(now_t6 - g_csv_next_t6[axis]) >= 0);
        }
    }
#endif

#if MOTION_CSV_PRODUCE_IN_TIM6
    /* Drena ring buffer (SPSC) produzido no TIM6, com limite por tick */
    uint32_t drained = 0u;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT && drained < MOTION_CSV_DRAIN_PER_TICK; ++axis) {
        while (drained < MOTION_CSV_DRAIN_PER_TICK) {
            motion_csv_sample_t s;
            if (!csv_ring_pop(axis, &s)) break;
            uint32_t t_val;
#if MOTION_CSV_TIME_IN_TICKS
            t_val = s.t6;
#else
            t_val = s.t6 / T6_TICKS_PER_MS;
#endif
            motion_csv_print(axis, s.id, t_val, s.rel, s.steps);
            drained++;
        }
    }
#endif

    // Atualiza sombras 32-bit para SWV/Data Trace (4 bytes por amostra)
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        g_enc_abs32[axis] = (int32_t)g_encoder_position[axis];
        g_enc_rel32[axis] = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
    }

    /* DEMO: aplica rampa e calcula incremento do DDA */
    if (g_status.state == MOTION_RUNNING && g_has_active_segment && g_demo_continuous) {
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];
            if (ax->emitted_steps >= ax->total_steps) continue;

            /* Aceleração integrada: acumula a/1000 e aplica passos discretos em v */
            g_v_accum[axis] += ax->accel_sps2; /* steps/s^2 * 1ms */
            uint32_t steps_avail = 0u;
            while (g_v_accum[axis] >= 1000u) { g_v_accum[axis] -= 1000u; steps_avail++; }
            while (steps_avail--) {
                if (ax->v_actual_sps < ax->v_target_sps) {
                    ax->v_actual_sps++;
                    if (ax->v_actual_sps > ax->v_target_sps) ax->v_actual_sps = ax->v_target_sps;
                } else if (ax->v_actual_sps > ax->v_target_sps) {
                    if (ax->v_actual_sps > 0u) ax->v_actual_sps--;
                    if (ax->v_actual_sps < ax->v_target_sps) ax->v_actual_sps = ax->v_target_sps;
                }
            }
            if (ax->v_actual_sps > MOTION_MAX_SPS) ax->v_actual_sps = MOTION_MAX_SPS;
            {
                uint32_t v_eff = ax->v_actual_sps;
#if MOTION_SIM_FRICTION_ENABLE
                if (g_sim_friction_active && axis == g_sim_friction_axis) {
                    uint8_t apply = 1u;
                    if (g_sim_friction_post_ramp && !g_sim_ramp_done[axis]) apply = 0u;
                    if (apply) {
                        uint32_t c = g_sim_friction_c_sps;
                        uint32_t b = g_sim_friction_b_pm;
                        uint32_t visc = (uint32_t)(((uint64_t)v_eff * (uint64_t)b) / 1000u);
                        uint32_t loss = c + visc;
                        v_eff = (loss >= v_eff) ? 0u : (v_eff - loss);
                    }
                }
#endif
                ax->dda_inc_q16 = Q16_DIV_UINT(v_eff, MOTION_TIM6_HZ);
            }
#if MOTION_SIM_FRICTION_ENABLE
            if (ax->v_actual_sps >= ax->v_target_sps) {
                g_sim_ramp_done[axis] = 1u;
            }
#endif
        }
    }
    /* Caminho da fila: rampa trapezoidal (acelera/cruza/desacelera) e define incremento DDA */
    if (g_status.state == MOTION_RUNNING && g_has_active_segment && !g_demo_continuous) {
        int8_t master_axis = -1;
        uint32_t rem_master = 0u;
#if MOTION_PROGRESS_MODE
        master_axis = motion_select_master_axis_progress();
        if (master_axis >= 0) {
            const motion_axis_state_t *am = &g_axis_state[(uint8_t)master_axis];
            uint32_t active_m = (am->total_steps > am->emitted_steps)
                                ? (am->total_steps - am->emitted_steps) : 0u;
            rem_master = active_m + g_queue_rem_steps[(uint8_t)master_axis];
        }
#endif
#if MOTION_DIAG_ENABLE
        g_dbg_master_axis = master_axis;
#endif
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];
            /* Mesmo que o segmento ativo para este eixo tenha zerado, podemos ter
               passos remanescentes na fila — mantemos a rampa global da lista. */

