vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
            uint32_t v_cmd_sps = ((uint32_t)ax->velocity_per_tick) * 1000u; /* alvo/cruzeiro */
#if MOTION_DIAG_ENABLE
            g_dbg_scale_pm[axis] = 1000u;
#endif

#if MOTION_PROGRESS_MODE && MOTION_ERR_THROTTLE_ENABLE
            /* Throttle por erro (apenas eixos não-mestres):
               - Usa o MESMO erro posicional do PI (steps físicos)
               - Ajusta v_cmd antes de aplicar correção PI */
            if (master_axis >= 0 && (int8_t)axis != master_axis) {
                int32_t desired  = (int32_t)ax->target_steps;
                int32_t actual   = motion_actual_steps_from_encoder(axis);
                int32_t err      = desired - actual;
                uint32_t err_abs = (err < 0) ? (uint32_t)(-err) : (uint32_t)err;

                uint32_t scale_pm;
                if (err_abs >= (uint32_t)MOTION_ERR_THROTTLE_THRESHOLD) {
                    scale_pm = (uint32_t)MOTION_ERR_THROTTLE_MIN_PERMILLE; /* piso */
                } else {
                    uint32_t range = 1000u - (uint32_t)MOTION_ERR_THROTTLE_MIN_PERMILLE; /* 0..750 */
                    uint32_t dec = (uint32_t)(((uint64_t)range * (uint64_t)err_abs) / (uint32_t)MOTION_ERR_THROTTLE_THRESHOLD);
                    scale_pm = 1000u - dec; /* 1000..min_permille */
                }
                v_cmd_sps = (uint32_t)(((uint64_t)v_cmd_sps * (uint64_t)scale_pm) / 1000u);
                if (v_cmd_sps > MOTION_MAX_SPS) v_cmd_sps = MOTION_MAX_SPS;
#if MOTION_DIAG_ENABLE
                g_dbg_scale_pm[axis] = scale_pm;
#endif
            }
#endif /* MOTION_PROGRESS_MODE && MOTION_ERR_THROTTLE_ENABLE */
            /* PI de posição: ajusta v_cmd_sps com base no erro posicional */
#if MOTION_PI_ENABLE
            if ((ax->kp | ax->ki | ax->kd) != 0u) {
                /* desired e actual em steps físicos do eixo */
                int32_t desired = (int32_t)ax->target_steps;
                int32_t actual  = motion_actual_steps_from_encoder(axis);
                int32_t err     = desired - actual;
                /* Deadband simples */
                if (err > -((int32_t)MOTION_PI_DEADBAND_STEPS) && err < (int32_t)MOTION_PI_DEADBAND_STEPS) {
                    err = 0;
                }
                /* Integral com anti-windup (em unidades de passos) */
                int32_t iacc = g_pi_i_accum[axis] + err;
                if (iacc > MOTION_PI_I_CLAMP) iacc = MOTION_PI_I_CLAMP;
                else if (iacc < -MOTION_PI_I_CLAMP) iacc = -MOTION_PI_I_CLAMP;
                int32_t draw = err - g_pi_prev_err[axis];
                g_pi_prev_err[axis] = err;
                /* Derivada filtrada: g_pi_d_filt += (draw - g_pi_d_filt) >> alpha */
                const int32_t alpha = 8; /* filtro leve (1..16) */
                g_pi_d_filt[axis] = g_pi_d_filt[axis] + ((draw - g_pi_d_filt[axis]) >> alpha);
                int32_t pterm = ((int32_t)ax->kp * err) >> MOTION_PI_SHIFT;      /* steps/s */
                int32_t iterm = ((int32_t)ax->ki * iacc) >> MOTION_PI_SHIFT;     /* steps/s */
                int32_t dterm = (ax->kd != 0u) ? (((int32_t)ax->kd * g_pi_d_filt[axis]) >> MOTION_PI_SHIFT) : 0; /* steps/s */
                int32_t corr = pterm + iterm + dterm; /* correção em steps/s */
                /* Teto dinâmico: mantém 20% de folga em relação ao alvo do segmento */
                uint32_t v_lim = ax->v_target_sps;
                uint32_t corr_cap = (uint32_t)(((uint64_t)v_lim * (uint64_t)MOTION_PI_MARGIN_PERMILLE) / 1000u);
                if (corr > (int32_t)corr_cap) corr = (int32_t)corr_cap;
                else if (corr < -(int32_t)corr_cap) corr = -(int32_t)corr_cap;
                int32_t v_adj = (int32_t)v_cmd_sps + corr;
                if (v_adj < 0) v_adj = 0;
                if (v_adj > (int32_t)MOTION_MAX_SPS) v_adj = (int32_t)MOTION_MAX_SPS; /* limite físico */
                v_cmd_sps = (uint32_t)v_adj;

                /* <<< AQUI entra o if de breakpoint >>> */
                if (axis == AXIS_Y &&                  // eixo que você quer estudar
                    g_status.state == MOTION_RUNNING && 
                    ax->emitted_steps < ax->total_steps &&  // ainda falta passo pra emitir
                    v_cmd_sps == 0u) {                     // PI derrubou a velocidade pra zero
//                    __BKPT(0);  // coloque breakpoint aqui ou deixe o BKPT mesmo
//                    __BKPT(0);  // coloque breakpoint aqui ou deixe o BKPT mesmo
                }

#if MOTION_DIAG_ENABLE
                g_dbg_err[axis]   = err;
                g_dbg_pterm[axis] = pterm;
                g_dbg_iterm[axis] = iterm;
                g_dbg_dterm[axis] = dterm;
                g_dbg_corr[axis]  = corr;
                g_dbg_v_adj[axis] = v_adj;
#endif
                /* Anti-windup por saturação: só aceita a integral quando não saturou */
                if (!(v_adj == 0 || v_adj == (int32_t)MOTION_MAX_SPS)) {
                    g_pi_i_accum[axis] = iacc;
                }
            }
#endif
            /* Guarda v_cmd resultante para diagnóstico */
#if MOTION_DIAG_ENABLE
            g_dbg_v_cmd_sps[axis] = v_cmd_sps;
#endif
            uint32_t a_sps2    = (ax->accel_sps2 > 0u) ? ax->accel_sps2 : DEMO_ACCEL_SPS2;

            /* Distância restante total (ativo + fila) em passos (O(1)) */
            uint32_t active_rem = (ax->total_steps > ax->emitted_steps)
                                  ? (ax->total_steps - ax->emitted_steps) : 0u;
            uint32_t rem_steps = active_rem + g_queue_rem_steps[axis];
#if MOTION_PROGRESS_MODE
            /* Só impõe o restante do mestre se ele tiver trabalho pendente */
            if (master_axis >= 0 && rem_master > 0u) {
                rem_steps = rem_master;
            }
            /* caso contrário, mantém o rem_steps do próprio eixo
               para não “matar” a rampa dos demais */
#endif

            /* Distância necessária para frear de v para 0: s = v^2 / (2a) */
            uint32_t v_now = ax->v_actual_sps;
            uint32_t s_brake = 0u;
            if (a_sps2 > 0u && v_now > 0u) {
                uint64_t vv = (uint64_t)v_now * (uint64_t)v_now;
                uint64_t denom = (uint64_t)(2u * a_sps2);
                s_brake = (uint32_t)(vv / denom);
            }

            /* Política de rampa:
             * - Se já estamos perto do final (rem_steps <= s_brake): desacelera.
             * - Caso contrário, acelera até v_cmd_sps; se passou, reduz até v_cmd_sps. */
            /* Aceleração integrada: usa g_v_accum para passos discretos de v */
            g_v_accum[axis] += a_sps2; /* steps/s^2 * 1ms */
            uint32_t steps_avail = 0u;
            while (g_v_accum[axis] >= 1000u) { g_v_accum[axis] -= 1000u; steps_avail++; }
            while (steps_avail--) {
                if (rem_steps <= s_brake) {
                    /* Desacelera */
                    if (ax->v_actual_sps > 0u) ax->v_actual_sps--;
                } else if (ax->v_actual_sps < v_cmd_sps) {
                    ax->v_actual_sps++;
                    if (ax->v_actual_sps > v_cmd_sps) ax->v_actual_sps = v_cmd_sps;
                } else if (ax->v_actual_sps > v_cmd_sps) {
                    if (ax->v_actual_sps > 0u) ax->v_actual_sps--;
                    if (ax->v_actual_sps < v_cmd_sps) ax->v_actual_sps = v_cmd_sps;
                }
            }
#if MOTION_SIM_FRICTION_ENABLE
            if (ax->v_actual_sps >= ax->v_target_sps) {
                g_sim_ramp_done[axis] = 1u;
            }
#endif

            /* Se não há mais nada a emitir neste eixo, força zero */
            if (rem_steps == 0u) ax->v_actual_sps = 0u;
            if (v_cmd_sps > MOTION_MAX_SPS) v_cmd_sps = MOTION_MAX_SPS;
            if (ax->v_actual_sps > MOTION_MAX_SPS) ax->v_actual_sps = MOTION_MAX_SPS;

            /* Incremento do DDA a 50 kHz (aplica atrito pós-rampa) */
            {
                uint32_t v_eff = ax->v_actual_sps;
#if MOTION_SIM_FRICTION_ENABLE
                if (g_sim_friction_active && axis == g_sim_friction_axis) {
                    uint8_t apply = 1u;
                    if (g_sim_friction_post_ramp && !g_sim_ramp_done[axis]) apply = 0u;
                    if (apply) {
                        uint32_t c = g_sim_friction_c_sps;
                        uint32_t b = g_sim_friction_b_pm;
                        uint32_t visc = (uint32_t)(((uint64_t)v_eff * (uint64_t)b) / 1000u);
                        uint32_t loss = c + visc;
                        v_eff = (loss >= v_eff) ? 0u : (v_eff - loss);
                    }
                }
#endif
                ax->dda_inc_q16 = Q16_DIV_UINT(v_eff, MOTION_TIM6_HZ);
            }
        }
    }

