vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    /* Diagnóstico: snapshots e detecção de stall em baixa taxa (TIM7) */
#if MOTION_DIAG_ENABLE
    motion_diag_tick();
#endif
}

/* =======================
 *  Handlers de protocolo
 * ======================= */
void motion_on_move_queue_add(const uint8_t *frame, uint32_t len) {

    move_queue_add_req_t req;
    uint8_t ack_status = MOTION_ACK_INVALID;
    uint8_t frame_id = 0u;

    if (!frame) return;
    proto_result_t decode_status = move_queue_add_req_decoder(frame, len, &req);
    if (decode_status != PROTO_OK) {
        motion_send_queue_add_ack(frame_id, ack_status);
        LOGA_THIS(LOG_STATE_ERROR, decode_status, "queue_add", "decode_fail");
        return;
    }
    frame_id = req.frameId;

    if (!safety_is_safe()) {
        motion_send_queue_add_ack(frame_id, ack_status);
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "queue_add", "blocked_safety");
        return;
    }

    uint32_t primask = motion_lock();
    proto_result_t push_status = motion_queue_push_locked(&req);
    if (push_status == PROTO_OK) {
        ack_status = MOTION_ACK_OK;
        if (g_status.state == MOTION_IDLE || g_status.state == MOTION_DONE)
            g_status.state = MOTION_QUEUED;
        motion_refresh_status_locked();
#if MOTION_DEBUG_FLOW
        printf("[FLOW queue_add ok id=%u dir=0x%02X V=(%u,%u,%u) S=(%lu,%lu,%lu) depth=%u]\r\n",
               (unsigned)frame_id,
               (unsigned)req.dirMask,
               (unsigned)req.vx, (unsigned)req.vy, (unsigned)req.vz,
               (unsigned long)req.sx, (unsigned long)req.sy, (unsigned long)req.sz,
               (unsigned)g_status.queue_depth);
#endif
    } else {
        ack_status = MOTION_ACK_QUEUE_FULL;
    }
    motion_unlock(primask);

    motion_send_queue_add_ack(frame_id, ack_status);
    LOGA_THIS(LOG_STATE_RECEIVED, ack_status, "queue_add",
              "frame=%u dirMask=0x%02X queue=%u",
              (unsigned)frame_id, (unsigned)req.dirMask, (unsigned)g_status.queue_depth);
}

void motion_on_move_queue_status(const uint8_t *frame, uint32_t len) {
    move_queue_status_req_t req;
    if (move_queue_status_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "queue_status", "decode_fail");
        return;
    }
    uint32_t primask = motion_lock();
    motion_refresh_status_locked();
    motion_unlock(primask);

    motion_send_queue_status_response(req.frameId);
    LOGA_THIS(LOG_STATE_RECEIVED, PROTO_OK, "queue_status",
              "state=%u depth=%u pct=(%u,%u,%u)",
              (unsigned)g_status.state, (unsigned)g_status.queue_depth,
              (unsigned)g_status.pctX, (unsigned)g_status.pctY, (unsigned)g_status.pctZ);
}

void motion_on_start_move(const uint8_t *frame, uint32_t len) {
    start_move_req_t req;
    if (start_move_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "start_move", "decode_fail");
        return;
    }
    uint8_t started = 0u;
    uint32_t primask = motion_lock();

#if MOTION_DEBUG_FLOW
    {
        uint16_t depth = (uint16_t)(g_queue_count + (g_has_active_segment ? 1u : 0u));
        printf("[FLOW start_move request depth=%u active=%u ids=(",
               (unsigned)((depth > 255u) ? 255u : depth), (unsigned)g_active_frame_id);
        for (uint16_t i = 0; i < g_queue_count; ++i) {
            uint8_t idxq = (uint8_t)(((uint16_t)g_queue_head + i) % MOTION_QUEUE_CAPACITY);
            unsigned id = (unsigned)g_queue[idxq].req.frameId;
            printf(i ? ",%u" : "%u", id);
        }
        printf(") ]\r\n");
    }
#endif

    if (!safety_is_safe()) {
        started = 0u;
    } else if (!g_has_active_segment) {
        if (motion_try_start_next_locked()) {
            g_status.state = MOTION_RUNNING;
            started = 1u;
        }
    } else {
        g_status.state = MOTION_RUNNING;
        started = 1u;
    }

    motion_refresh_status_locked();
    motion_unlock(primask);

    (void)HAL_TIM_Base_Start_IT(&htim6);
    (void)HAL_TIM_Base_Start_IT(&htim7);

    // Arma sessões CSV para iniciarem no primeiro STEP; zera contadores
    if (started) {
        uint32_t pm = motion_lock();
        for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
            g_csv_armed[a] = 1u;             // iniciar ao primeiro STEP
            g_csv_active[a] = 0u;            // ainda não iniciou
            g_csv_t0_ms[a]  = 0u;
            g_csv_stepcount[a] = 0u;         // zera contador de passos
            g_csv_next_ms[a] = 0u;           // será setado no primeiro STEP
            g_csv_t0_t6[a] = 0u;
            g_csv_next_t6[a] = 0u;
            g_csv_seq[a] = 0u;               // reinicia id incremental por start_move
        }
        motion_unlock(pm);
#if MOTION_CSV_PRODUCE_IN_TIM6
        csv_ring_reset();
        /* agenda primeira produção 1ms à frente do tempo atual */
        g_csv_next_prod_t6 = g_tim6_ticks + (uint32_t)T6_TICKS_PER_MS;
#endif
    }

    motion_send_start_response(req.frameId, started ? 0u : 1u, g_status.queue_depth);
    LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "start_move", started ? "running" : "ignored");
#if MOTION_DEBUG_FLOW
    printf("[FLOW start_move %s]\r\n", started ? "running" : "ignored");
#endif
#if MOTION_SIM_FRICTION_ENABLE
    /* Captura tamanho inicial da fila (inclui ativo) para auto_half */
    uint16_t depth = (uint16_t)(g_queue_count + (g_has_active_segment ? 1u : 0u));
    g_sim_initial_items = depth;
    g_sim_processed_items = 0u;
#endif
}

void motion_on_move_end(const uint8_t *frame, uint32_t len) {
    move_end_req_t req;
    if (move_end_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "move_end", "decode_fail");
        return;
    }
    uint32_t primask = motion_lock();
    motion_stop_all_axes_locked();
    motion_queue_clear_locked();
    g_has_active_segment = 0u;
    g_status.state = MOTION_STOPPING;
    motion_refresh_status_locked();
    motion_unlock(primask);

    motion_send_move_end_response(req.frameId, 1u /* stopped by host */);

    primask = motion_lock();
    g_status.state = MOTION_IDLE;
    motion_refresh_status_locked();
    motion_unlock(primask);

    LOGT_THIS(LOG_STATE_APPLIED, PROTO_OK, "move_end", "stopped");
}

/* =======================
 *  set_origin e encoder_status (telemetria)
 * ======================= */
void motion_on_set_origin(const uint8_t *frame, uint32_t len) {
    set_origin_req_t req;
    if (set_origin_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_origin", "decode_fail");
        return;
    }
    uint8_t m = req.mask & 0x07u;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        if (m & (1u << axis)) {
            /* Define base externa como a posição absoluta atual e zera relativo */
            int64_t pos = g_encoder_position[axis];
            if (pos > INT32_MAX) pos = INT32_MAX; else if (pos < INT32_MIN) pos = INT32_MIN;
            g_origin_base32[axis] = (int32_t)pos;
            g_encoder_origin[axis] = g_encoder_position[axis];
        }
    }
    set_origin_resp_t resp;
    resp.frameId = req.frameId;
    resp.x0 = g_origin_base32[AXIS_X];
    resp.y0 = g_origin_base32[AXIS_Y];
    resp.z0 = g_origin_base32[AXIS_Z];
    uint8_t raw[16];
    if (set_origin_resp_encoder(&resp, raw, sizeof raw) == PROTO_OK) {
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
    LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_origin", "mask=0x%02X mode=%u", (unsigned)req.mask, (unsigned)req.mode);
}

void motion_on_encoder_status(const uint8_t *frame, uint32_t len) {
    encoder_status_req_t req;
    if (encoder_status_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "enc_status", "decode_fail");
        return;
    }
    /* posição_rel = position - origin; posição_abs = origin_base + posição_rel */
    int32_t rel[3];
    int32_t abs[3];
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        int64_t r = g_encoder_position[axis] - g_encoder_origin[axis];
        if (r > INT32_MAX) r = INT32_MAX; else if (r < INT32_MIN) r = INT32_MIN;
        rel[axis] = (int32_t)r;
        int64_t a = (int64_t)g_origin_base32[axis] + (int64_t)rel[axis];
        if (a > INT32_MAX) a = INT32_MAX; else if (a < INT32_MIN) a = INT32_MIN;
        abs[axis] = (int32_t)a;
    }
    encoder_status_resp_t resp;
    resp.frameId = req.frameId;
    resp.pidErrX = (uint8_t)g_status.pidErrX;
    resp.pidErrY = (uint8_t)g_status.pidErrY;
    resp.pidErrZ = (uint8_t)g_status.pidErrZ;
    resp.delta = 0; /* opcional */
    resp.absX = abs[AXIS_X];
    resp.absY = abs[AXIS_Y];
    resp.absZ = abs[AXIS_Z];
    uint8_t raw[20];
    if (encoder_status_resp_encoder(&resp, raw, sizeof raw) == PROTO_OK) {
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

void motion_on_set_microsteps(const uint8_t *frame, uint32_t len) {
    set_microsteps_req_t req;
    if (set_microsteps_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_microsteps", "decode_fail");
        return;
    }
    if (g_status.state == MOTION_RUNNING) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "set_microsteps", "busy_running");
        return;
    }
    /* Interpreta 0 como 256 para cobrir todo o conjunto {1,2,4,...,256} em 8 bits */
    uint16_t ms = (req.microsteps == 0u) ? 256u : req.microsteps;
    if (ms > 256u) ms = 256u;
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_microstep_factor[a] = ms;
    LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_microsteps", "all_axes_ms=%u", (unsigned)ms);
    /* Log humano-legível do valor aplicado */
    printf("[MICROSTEPS] all_axes=%u\r\n", (unsigned)ms);
    /* ACK detalhado (6 bytes): [HDR, TYPE, frameId, ms_hi, ms_lo, TAIL] */
    {
        uint8_t raw[6] = { RESP_HEADER, RESP_SET_MICROSTEPS, (uint8_t)req.frameId,
                           (uint8_t)(ms >> 8), (uint8_t)(ms & 0xFF), RESP_TAIL };
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

